
nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]          # 2

  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4 P3

  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 6, C2f, [512, True]]          # 6 P4

  - [-1, 1, SPPF, [512, 5]]            # 7 P4-SPPF

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          # SPPF P4 upsample + backbone P3
  - [-1, 3, C2f, [256]]                # 10 P3 head

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]          # P3 -> P4 + P4-SPPF
  - [-1, 3, C2f, [512]]                # 13 P4 head

  - [[10, 13], 1, Detect, [nc]]        # Detect(P3, P4)