# YOLOv8n-C2fGhost
# Goal: reduce Params and GFLOPs while preserving PDT small-object accuracy

nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]          # 2 keep early features

  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4 keep P3 for small objects

  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 6, C2fGhost, [512, True]]     # 6 ghost P4

  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 3, C2fGhost, [1024, True]]    # 8 ghost P5
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fGhost, [512]]           # 12 ghost head P4

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                # 15 keep P3 head

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2fGhost, [512]]           # 18 ghost head P4

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2fGhost, [1024]]          # 21 ghost head P5

  - [[15, 18, 21], 1, Detect, [nc]]