# YOLOv8n-PDTLite
# Proposed architecture for PDT UAV dense small/medium object detection
# Main changes:
# 1. Remove P5 large-object branch
# 2. Detect only P3 and P4
# 3. Replace selected C2f blocks with C2fPDT lightweight blocks

nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  # P1/P2
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]          # 2 keep early feature extraction

  # P3 small-object feature
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4 keep P3 strong for small objects

  # P4 medium-object feature
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 6, C2fPDT, [512, True, 0.375]] # 6 lightweight P4

head:
  # P4 -> P3 fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2fPDT, [256, False, 0.375]] # 9 lightweight P3 head

  # P3 -> P4 fusion
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fPDT, [512, False, 0.375]] # 12 lightweight P4 head

  # Detect only small and medium objects
  - [[9, 12], 1, Detect, [nc]]