# YOLOv8n + C3k2 at P3/P4 + ECA Attention
# Designed for PDT UAV dense small-target detection on resource-constrained hardware

nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f, [128, True]]          # 2

  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C3k2, [256, True]]         # 4 P3 C3k2
  - [-1, 1, ECAAttention, []]          # 5 ECA after P3

  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 6, C3k2, [512, True]]         # 7 P4 C3k2
  - [-1, 1, ECAAttention, []]          # 8 ECA after P4

  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32
  - [-1, 3, C2f, [1024, True]]         # 10
  - [-1, 1, SPPF, [1024, 5]]           # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 8], 1, Concat, [1]]          # cat backbone P4
  - [-1, 3, C2f, [512]]                # 14

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 5], 1, Concat, [1]]          # cat backbone P3
  - [-1, 3, C2f, [256]]                # 17 P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]         # cat head P4
  - [-1, 3, C2f, [512]]                # 20 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]         # cat head P5
  - [-1, 3, C2f, [1024]]               # 23 P5/32-large

  - [[17, 20, 23], 1, Detect, [nc]]