# YOLOv8n-DualSK-Lite for Raspberry Pi 4
# Main idea:
# - Keep P3/P4/P5 detection heads
# - Add C2fDualSK only in late backbone stages
# - Use GhostConv/C2fGhost in neck to recover speed

nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2

  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]        # 4, keep normal C2f for small features

  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2fDualSK, [512, True]]  # 6, DualSK stage 1

  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2fDualSK, [1024, True]] # 8, DualSK stage 2
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # cat backbone P4
  - [-1, 3, C2fGhost, [512]]         # 12, lightweight neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # cat backbone P3
  - [-1, 3, C2f, [256]]              # 15, keep stronger P3 for small objects

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]       # cat head P4
  - [-1, 3, C2fGhost, [512]]         # 18

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]        # cat head P5
  - [-1, 3, C2fGhost, [1024]]        # 21

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)