nc: 1

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2

  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]        # 4 P3

  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]        # 6 P4
  - [-1, 1, DualSKAdd, [4]]          # 7 P4 refined, r=4

  - [-1, 1, Conv, [1024, 3, 2]]      # 8-P5/32
  - [-1, 3, C2f, [1024, True]]       # 9
  - [-1, 1, SPPF, [1024, 5]]         # 10
  - [-1, 1, DualSKAdd, [4]]          # 11 P5 refined, r=4

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 7], 1, Concat, [1]]                  # 13
  - [-1, 3, C2f, [512]]                        # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16
  - [-1, 3, C2f, [256]]                        # 17

  - [-1, 1, Conv, [256, 3, 2]]                 # 18
  - [[-1, 14], 1, Concat, [1]]                 # 19
  - [-1, 3, C2f, [512]]                        # 20

  - [-1, 1, Conv, [512, 3, 2]]                 # 21
  - [[-1, 11], 1, Concat, [1]]                 # 22
  - [-1, 3, C2f, [1024]]                       # 23

  - [[17, 20, 23], 1, Detect, [nc]]            # 24